src/osw/solvers/openfoam/templates/cavity/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0 0 0)
    ($length 0 0)
    ($length $length 0)
    (0 $length 0)
    (0 0 $z_thickness)
    ($length 0 $z_thickness)
    ($length $length $z_thickness)
    (0 $length $z_thickness)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($cells_x $cells_y $cells_z) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    $moving_wall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    $fixed_walls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
        );
    }
    $front_and_back
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
